'''
1-缩进：类、函数、逻辑代码块都是通过缩进的方式来划分的/
一般4个空格/每个代码块中缩进的空格数要一致/
不同模块之间，缩进数可以不一致

2-多行：一行太过长的时候，一般建议利用反斜杠 \ 换行显示；一般一行建议不要超过80个字符
3-引号：单引号、双引号、三引号来定义一个字符串；单引号和双引号一样；三引号-一般用在多行字符串的情况下
4-注释：#单行注释；三个单引号注释多行内容
5-空行：类、函数、代码块之间都先空一行，以表明新代码块开始
6-输入、输出：input / print
7-一行多个语句：同分号;来支持一行写多个语句的，但这种写法是不建议的
8-导入模块：import / from import
'''

import demo1
demo1.fun1()

# import math
# print(math.pi)

# from math import pi
# # print(pi)
# print(pi)

# print("请输入X的值：");x = input();print("刚才输入的X值为：",x)

# str = """我是
# 一个字符串"""
# print(str)

# if 1==1 \
#     and 2==2 \
#     and 3==3:
#     print(True)

# if 1==1:
#  print(True)
#  print(1)

# if 2==2:
#     print(2)


